; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v2 ?v8)
             (pred_10 ?v9 ?v1)
             (pred_4 ?v2 ?v1)
             (pred_7 ?v10 ?v2 )
	     (pred_3 ?v2)
             (pred_5 ?v5)
             (pred_1 ?v9)
             (pred_11 ?v1)
             (pred_6 ?v2)
             (pred_2 ?v9)
             (pred_8 ?v2)
             (pred_9 ))



(:action op_1
:parameters (?v12 ?v13 ?v6 ?v4)
:precondition (and (pred_5 ?v12) (pred_5 ?v13) (pred_1 ?v6) (pred_11 ?v4)
          (pred_12 ?v12 ?v13) (pred_10 ?v6 ?v4)
                   (pred_4 ?v13 ?v4) (pred_3 ?v12) 
                   (pred_6 ?v13) (pred_2 ?v6))
:effect (and  (pred_8 ?v13) (not (pred_6 ?v13))))


(:action op_2
:parameters (?v12 ?v3)
:precondition (and (pred_5 ?v12) (pred_5 ?v3)
               (pred_3 ?v12) (pred_12 ?v12 ?v3) (pred_8 ?v3))
:effect (and (pred_3 ?v3) (not (pred_3 ?v12))))

(:action op_5
:parameters (?v12 ?v6)
:precondition (and (pred_5 ?v12) (pred_1 ?v6) 
                  (pred_3 ?v12) (pred_7 ?v6 ?v12) (pred_9 ))
:effect (and (pred_2 ?v6)
   (not (pred_7 ?v6 ?v12)) (not (pred_9 ))))


(:action op_4
:parameters (?v12 ?v7 ?v11)
:precondition (and (pred_5 ?v12) (pred_1 ?v7) (pred_1 ?v11)
                  (pred_3 ?v12) (pred_2 ?v11) (pred_7 ?v7 ?v12))
:effect (and (pred_2 ?v7) (pred_7 ?v11 ?v12)
        (not (pred_2 ?v11)) (not (pred_7 ?v7 ?v12))))

(:action op_3
:parameters (?v12 ?v6)
:precondition (and (pred_5 ?v12) (pred_1 ?v6) 
                  (pred_3 ?v12) (pred_2 ?v6))
:effect (and (pred_9 ) (pred_7 ?v6 ?v12) (not (pred_2 ?v6)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_16 obj_04 obj_12 obj_05 obj_19 obj_13 obj_09 obj_03 obj_07 obj_14 obj_08 obj_06 obj_17 obj_11 obj_10
    obj_15 obj_20
    obj_18 obj_02
    )

    (:init
       (pred_9)

       (pred_5 obj_01)
       (pred_5 obj_16)
       (pred_5 obj_04)
       (pred_5 obj_12)
       (pred_5 obj_05)
       (pred_5 obj_19)
       (pred_5 obj_13)
       (pred_5 obj_09)
       (pred_5 obj_03)
       (pred_5 obj_07)
       (pred_5 obj_14)
       (pred_5 obj_08)
       (pred_5 obj_06)
       (pred_5 obj_17)
       (pred_5 obj_11)
       (pred_5 obj_10)
       (pred_11 obj_15)
       (pred_11 obj_20)
       (pred_1 obj_18)
       (pred_1 obj_02)

       (pred_12 obj_01 obj_05)
       (pred_12 obj_01 obj_16)
       (pred_12 obj_16 obj_19)
       (pred_12 obj_16 obj_04)
       (pred_12 obj_16 obj_01)
       (pred_12 obj_04 obj_13)
       (pred_12 obj_04 obj_12)
       (pred_12 obj_04 obj_16)
       (pred_12 obj_12 obj_09)
       (pred_12 obj_12 obj_04)
       (pred_12 obj_05 obj_03)
       (pred_12 obj_05 obj_19)
       (pred_12 obj_05 obj_01)
       (pred_12 obj_19 obj_07)
       (pred_12 obj_19 obj_13)
       (pred_12 obj_19 obj_16)
       (pred_12 obj_19 obj_05)
       (pred_12 obj_13 obj_14)
       (pred_12 obj_13 obj_09)
       (pred_12 obj_13 obj_04)
       (pred_12 obj_13 obj_19)
       (pred_12 obj_09 obj_08)
       (pred_12 obj_09 obj_12)
       (pred_12 obj_09 obj_13)
       (pred_12 obj_03 obj_06)
       (pred_12 obj_03 obj_07)
       (pred_12 obj_03 obj_05)
       (pred_12 obj_07 obj_17)
       (pred_12 obj_07 obj_14)
       (pred_12 obj_07 obj_19)
       (pred_12 obj_07 obj_03)
       (pred_12 obj_14 obj_11)
       (pred_12 obj_14 obj_08)
       (pred_12 obj_14 obj_13)
       (pred_12 obj_14 obj_07)
       (pred_12 obj_08 obj_10)
       (pred_12 obj_08 obj_09)
       (pred_12 obj_08 obj_14)
       (pred_12 obj_06 obj_17)
       (pred_12 obj_06 obj_03)
       (pred_12 obj_17 obj_11)
       (pred_12 obj_17 obj_07)
       (pred_12 obj_17 obj_06)
       (pred_12 obj_11 obj_10)
       (pred_12 obj_11 obj_14)
       (pred_12 obj_11 obj_17)
       (pred_12 obj_10 obj_08)
       (pred_12 obj_10 obj_11)
       (pred_6 obj_13)
       (pred_6 obj_05)
       (pred_4  obj_13 obj_15)
       (pred_4  obj_05 obj_20)
       (pred_8 obj_01)
       (pred_8 obj_16)
       (pred_8 obj_04)
       (pred_8 obj_12)
       (pred_8 obj_19)
       (pred_8 obj_09)
       (pred_8 obj_03)
       (pred_8 obj_07)
       (pred_8 obj_14)
       (pred_8 obj_08)
       (pred_8 obj_06)
       (pred_8 obj_17)
       (pred_8 obj_11)
       (pred_8 obj_10)

       (pred_10  obj_18 obj_15)
       (pred_10  obj_02 obj_20)
       (pred_7 obj_18 obj_04)
       (pred_7 obj_02 obj_07)
       (pred_3 obj_19)
    )

    (:goal (and
       (pred_7 obj_18 obj_19)
       (pred_7 obj_02 obj_12)
    ))
(:constraints
  (always (not (pred_3 obj_16)))
)
)

; plan
1. (op_2 obj_19 obj_07)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_07)
   goals met: 0 of 2
2. (op_5 obj_07 obj_02)
   deleted: (pred_7 obj_02 obj_07) (pred_9)
   added: (pred_2 obj_02)
   goals met: 0 of 2
3. (op_2 obj_07 obj_19)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_19)
   goals met: 0 of 2
4. (op_3 obj_19 obj_02)
   deleted: (pred_2 obj_02)
   added: (pred_9) (pred_7 obj_02 obj_19)
   goals met: 0 of 2
5. (op_2 obj_19 obj_07)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_07)
   goals met: 0 of 2
6. (op_2 obj_07 obj_14)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_14)
   goals met: 0 of 2
7. (op_2 obj_14 obj_08)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_08)
   goals met: 0 of 2
8. (op_2 obj_08 obj_09)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_09)
   goals met: 0 of 2
9. (op_2 obj_09 obj_12)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_12)
   goals met: 0 of 2
10. (op_2 obj_12 obj_04)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_04)
   goals met: 0 of 2
11. (op_5 obj_04 obj_18)
   deleted: (pred_7 obj_18 obj_04) (pred_9)
   added: (pred_2 obj_18)
   goals met: 0 of 2
12. (op_1 obj_04 obj_13 obj_18 obj_15)
   deleted: (pred_6 obj_13)
   added: (pred_8 obj_13)
   goals met: 0 of 2
13. (op_2 obj_04 obj_13)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_13)
   goals met: 0 of 2
14. (op_2 obj_13 obj_19)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_19)
   goals met: 0 of 2
15. (op_4 obj_19 obj_02 obj_18)
   deleted: (pred_2 obj_18) (pred_7 obj_02 obj_19)
   added: (pred_2 obj_02) (pred_7 obj_18 obj_19)
   goals met: 1 of 2
16. (op_2 obj_19 obj_13)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_13)
   goals met: 1 of 2
17. (op_2 obj_13 obj_04)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_04)
   goals met: 1 of 2
18. (op_2 obj_04 obj_12)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_12)
   goals met: 1 of 2
19. (op_3 obj_12 obj_02)
   deleted: (pred_2 obj_02)
   added: (pred_9) (pred_7 obj_02 obj_12)
   goals met: 2 of 2
